In [1]:
import pandas as pd

In [3]:
series = pd.Series([1,3,5,6,8])
series

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [4]:
data = {
    'apples': [3,2,0,1],
    'oranges': [0,3,7,2],
    'peaches': [2,4,6,8]
}
fruits = pd.DataFrame(data)
fruits

   apples  oranges  peaches
0       3        0        2
1       2        3        4
2       0        7        6
3       1        2        8

In [5]:
buyer = pd.DataFrame(data, index=['Tom','Isabelle','Daisy','Blathers'])
buyer

          apples  oranges  peaches
Tom            3        0        2
Isabelle       2        3        4
Daisy          0        7        6
Blathers       1        2        8

In [6]:
buyer.loc['Tom']

apples     3
oranges    0
peaches    2
Name: Tom, dtype: int64

In [7]:
#multiply 1,000,000 to each fruit
buyer = buyer * 1_000_000
buyer

           apples  oranges  peaches
Tom       3000000        0  2000000
Isabelle  2000000  3000000  4000000
Daisy           0  7000000  6000000
Blathers  1000000  2000000  8000000

In [8]:
buyer > 6_000_000

          apples  oranges  peaches
Tom        False    False    False
Isabelle   False    False    False
Daisy      False     True    False
Blathers   False    False     True

In [10]:
companies = {
    'Value': [220, 160, 140, 117, 94],
    'Change': [17.5, 11.9, -8.5, -2.1, 3.5],
    'Sector': ['Ratail', 'Tech', 'Tech', 'Tech', 'Tech']
}

data = pd.DataFrame(companies, index=['Amazon','Google','Apple','Microsoft','Samsung'])
data

           Value  Change  Sector
Amazon       220    17.5  Ratail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsung
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Value   5 non-null      int64
 1   Change  5 non-null      float64
 2   Sector  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 120.0+ bytes

In [12]:
data.columns

Index(['Value', 'Change', 'Sector'], dtype='object')

In [13]:
data.index

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'], dtype='object')

In [15]:
data.describe()

            Value     Change
count    5.000000   5.000000
mean   146.200000   4.460000
std     48.095738  10.456003
min     94.000000  -8.500000
25%    117.000000  -2.100000
50%    140.000000   3.500000
75%    160.000000  11.900000
max    220.000000  17.500000

In [16]:
data.loc[data['Value'] > 150]

        Value  Change  Sector
Amazon    220    17.5  Ratail
Google    160    11.9    Tech

In [17]:
data['Change']

Amazon       17.5
Google       11.9
Apple        -8.5
Microsoft    -2.1
Samsung       3.5
Name: Change, dtype: float64

In [18]:
data

           Value  Change  Sector
Amazon       220    17.5  Ratail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [20]:
data.iloc[3]

Value      117
Change    -2.1
Sector    Tech
Name: Microsoft, dtype: object

In [21]:
data.iloc[1:4, 1:3]

           Change Sector
Google       11.9   Tech
Apple        -8.5   Tech
Microsoft    -2.1   Tech

In [22]:
data[0:3]

        Value  Change  Sector
Amazon    220    17.5  Ratail
Google    160    11.9    Tech
Apple     140    -8.5    Tech

In [23]:
data

           Value  Change  Sector
Amazon       220    17.5  Ratail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [24]:
data['Value'].mul(2)

Amazon       440
Google       320
Apple        280
Microsoft    234
Samsung      188
Name: Value, dtype: int64

In [25]:
data['Value'].sub(2)

Amazon       218
Google       158
Apple        138
Microsoft    115
Samsung       92
Name: Value, dtype: int64

In [27]:
data['Value'].add(2)

Amazon       222
Google       162
Apple        142
Microsoft    119
Samsung       96
Name: Value, dtype: int64

In [28]:
div, rem = divmod(data['Value'], 2)
div,rem

(Amazon       110
 Google        80
 Apple         70
 Microsoft     58
 Samsung       47
 Name: Value, dtype: int64,
 Amazon       0
 Google       0
 Apple        0
 Microsoft    1
 Samsung      0
 Name: Value, dtype: int64)

In [29]:
data.mean()

Value     146.20
Change      4.46
dtype: float64

In [31]:
data.sum(0)

Value                        731
Change                      22.3
Sector    RatailTechTechTechTech
dtype: object

In [32]:
data.sum(1)

Amazon       237.5
Google       171.9
Apple        131.5
Microsoft    114.9
Samsung       97.5
dtype: float64

In [33]:
data.std()

Value     48.095738
Change    10.456003
dtype: float64

In [34]:
data.quantile(.5)

Value     140.0
Change      3.5
Name: 0.5, dtype: float64

In [35]:
data.min()

Value         94
Change      -8.5
Sector    Ratail
dtype: object

In [36]:
data.cumsum()

           Value  Change                  Sector
Amazon       220    17.5                  Ratail
Google       380    29.4              RatailTech
Apple        520    20.9          RatailTechTech
Microsoft    637    18.8      RatailTechTechTech
Samsung      731    22.3  RatailTechTechTechTech

In [37]:
data.count()

Value     5
Change    5
Sector    5
dtype: int64